#+STARTUP: showall

#+latex_class: article
#+LATEX: \setlength{\parindent}{0em}
#+LATEX_HEADER: \usepackage{comment}
#+LATEX_HEADER: \usepackage{gentium}
#+LATEX_HEADER: \usepackage{array}
#+LATEX_HEADER: \usepackage{tabularx}
#+LaTeX_HEADER: \usepackage[top=1in, bottom=1.25in, left=1.25in, right=1.25in]{geometry}
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+options: num:2 toc:nil

#+attr_latex: :align c
| \Large SSN College of Engineering (Autonomous)  |
| (Affiliated to Anna University, Chennai)        |
|                                                 |
| \Large *R2021 REPORT ON CURRICULUM DEVELOPMENT* |
|                                                 |
| 9 February 2021                                 |


* Basic Data
| Dept:         | Computer Science and Engineering |
| Co-ordinator: | R S Milton                       |

** Benchmarked universities for curriculum reference
| SNo | University / Institute | Regulation reference [year] | Credits |
|-----+------------------------+-----------------------------+---------|
|   1 | Anna University        |                        2017 |     184 |
|   2 | VIT                    |                        2019 |     160 |
|   3 | NUS                    |                             |     160 |
The distribution among the categories (HS, BS and so on) are different.

* Specific data
** Total Credits = 163

** R2018, R2021, AICTE Comparision  
#+NAME: categorywise_credits
#+HEADER: :colnames yes
#+BEGIN_SRC python :var curriculum=curriculum :results output table :exports none
  row_header = ['Sem', 'HS', 'BS', 'ES', 'PC', 'PE', 'OE', 'EEC', 'MC', 'Total']
  col_header = ['1', '2', '3', '4', '5', '6', '7',  '8']
  R2021 = [0 for col in row_header]
  R2021[0] = 'R2021'
  R2018 = ['R2018', 12, 26.5, 15.5, 87.5, 15, 6, 11.5]
  AICTE = ['AICTE', 12, 24, 29, 49, 18, 12, 15]
  Diff = [0 for col in row_header]
  Diff[0] = 'R2021->AICTE'
  semester_category_tab = []
  semester_category_tab.append(row_header)
  sem = 0
  state = 1
  for row in curriculum:
      subject = row[2]
      category = row[3]
      credits = row[8]
      if state == 1 and 'Semester' in subject:
          sem += 1
          state = 2
          category_dict = {'HS':0, 'BS':0, 'ES':0, 'PC':0, 'PE':0, 'OE':0, 'EEC':0, 'MC':0}
      elif state == 2: # 'Theory' in subject
          state = 3
      elif state == 3: # Actual subject row
          state = 4
      elif state == 4 and 'Practical' in subject:
          state = 5
      elif state == 5:
          state = 6
      elif state == 6 and 'Total' in subject:
          state = 1
          semester_summary = [col_header[sem-1]]
          for category in ['HS', 'BS', 'ES', 'PC', 'PE', 'OE', 'EEC', 'MC']:
              semester_summary.append(category_dict[category])
          semester_category_tab.append(semester_summary)
          #print (semester_summary)
      if state == 4 or state == 6:
          #print (sem, subject, category, credits)
          category_dict[category] += credits

  semester_category_tab += [R2021, R2018, AICTE, Diff]
  print (semester_category_tab)
  #print('#+TBLFM: $>=vsum($<<..$>>);%2d::@10$<<..@10$>=vsum(@I..@II)::@>$<<..@>$>=@-3-@-1')
#+END_SRC

#+name: categorywise_credits
|          Sem | HS |   BS |   ES |    PC | PE | OE |  EEC | MC | Total |
|--------------+----+------+------+-------+----+----+------+----+-------|
|            1 |  3 | 11.5 |  7.5 |     0 |  0 |  0 |    0 |  0 |    22 |
|            2 |  3 |    4 | 12.0 |     0 |  0 |  0 |    0 |  0 |    19 |
|            3 |  3 |    4 |  4.5 |   9.5 |  0 |  0 |    0 |  0 |    21 |
|            4 |  0 |    4 |    0 |  16.0 |  0 |  0 |    0 |  0 |    20 |
|            5 |  3 |    0 |    0 |  15.0 |  3 |  0 |    0 |  0 |    21 |
|            6 |  0 |    0 |    0 |  16.0 |  3 |  3 |    0 |  0 |    22 |
|            7 |  0 |    0 |    0 |    10 |  9 |  0 |    5 |  0 |    24 |
|            8 |  0 |    0 |    0 |     0 |  3 |  3 |    8 |  0 |    14 |
|--------------+----+------+------+-------+----+----+------+----+-------|
|        R2021 | 12 | 23.5 |  24. |  66.5 | 18 |  6 |   13 |  0 |   163 |
|        R2018 | 12 | 26.5 | 15.5 |  87.5 | 15 |  6 | 11.5 |    |   174 |
|        AICTE | 12 |   24 |   29 |    49 | 18 | 12 |   15 |    |   159 |
| R2018->R2021 |  0 |  -3. |  8.5 |  -21. |  3 |  0 |  1.5 |  0 |   -11 |
| R2021->AICTE |  0 |  0.5 |   5. | -17.5 |  0 |  6 |    2 |  0 |    -4 |
#+TBLFM: $>=vsum($<<..$>>);%2d::@10$<<..@10$>=vsum(@I..@II)::@>>$<<..@>>$>=@-3-@-2::@>$<<..@>$>=@-2-@-4

#+latex: \newpage

** COMMENT Decided
1. Combine
   1. Data Structures (Sem 3) and C (Sem 2) -> Sem 2
2. Remove
   1. UNIX and Shell Programming, Sem 3
   2. Machine Learning
   3. Computer Graphics and Multimedia
3. Move
   1. DAA: Sem 4 -> Sem 3
   2. SE: -> Sem 5
   3. AI: Sem

** Method of credit reduction from R2018
#+name: changes
#+attr_latex: :environment longtable :align @{}p{.04\textwidth}p{.06\textwidth}p{.3\textwidth}p{.05\textwidth}p{.1\textwidth}p{.05\textwidth}p{.3\textwidth}p{.05\textwidth}
|     |     | <25>                      |      |          |     | <25>                      |      |
| Sno | Sem | R2018                     |   Cr | Change   | Sem | R2021                     |   Cr |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     | *HS*                      |      |          |     |                           |      |
|   1 |   2 | Technical English         |    3 | Remove   |     |                           |      |
|   2 |   2 | Environmental Science     |    3 | Credit   |   2 | Environmental Science     |    0 |
|   3 |     |                           |      | Add      |   2 | Humanities Elective I     |    3 |
|   4 |     |                           |      | Add      |   3 | Universal Human Values II |    3 |
|   5 |     |                           |      | Add      |   4 | Essence of Indian Traditional Knowledge / Indian Constitution (MC) |    0 |
|   6 |     |                           |      | Add      |   5 | Management Elective       |    3 |
|   7 |   7 | Management and Ethical Practices |    3 | Remove   |     |                           |      |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           |    9 | 0        |     |                           |    9 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     | *BS*                      |      |          |     |                           |      |
|   8 |     | Physics for Information Science |    3 | Remove   |     |                           |      |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           |    3 | -3       |     |                           |    0 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     | *ES*                      |      |          |     |                           |      |
|   9 |   1 | Basic Electrical, Electronics and Measurement Engineering |  3.5 | Remove   |     |                           |      |
|  10 |     |                           |      | Add      |   1 | Basic Electrical and Electronics Engineering |    3 |
|  11 |     |                           |      | Add      |   2 | Engineering Fundamentals and Practices |    3 |
|  12 |     |                           |      | Add      |   2 | EFP Lab                   |  1.5 |
|  13 |   3 | Principles of Communication Engineering |    3 | Remove   |     |                           |      |
|  14 |     |                           |      | Add      |   3 | Foundations of Data Science |    3 |
|  15 |     |                           |      | Category |   3 | Digital Principles and System Design |    3 |
|  16 |     |                           |      | Category |   3 | Digital Design Lab        |  1.5 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           |  6.5 | 9.       |     |                           | 15.0 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     | *PC*                      |      |          |     |                           |      |
|  17 |   2 | Programming in C (Theory) |  3.5 | Merge    |     |                           |      |
|  18 |   2 | Programming in C (Lab)    |  1.5 | Merge    |     |                           |      |
|  19 |   3 | Data Structures (Theory)  |    3 | Merge    |   2 | Data Structures (Theory)  |    3 |
|  20 |   3 | Data Structures (Lab)     |    2 | Merge    |   2 | Data Structures (Lab)     |    2 |
|  21 |   3 | Digital Principles and System Design |    3 | Category |     |                           |      |
|  22 |   3 | Digital Lab               |  1.5 | Category |     |                           |      |
|  23 |   3 | UNIX and Shell Programming |    3 | Remove   |     |                           |      |
|  24 |   5 | Theory of Computation     |    4 | Credits  |   5 | Theory of Computation     |    3 |
|  25 |   5 | Introduction to Cryptographic Techniques |    3 | Remove   |     |                           |      |
|  26 |     |                           |      | Add      |   6 | Machine Learning (Lab)    |  1.5 |
|  27 |     |                           |      | Add      |   6 | Data Security and Privacy |    3 |
|  28 |   7 | Mobile Computing          |    3 | Remove   |     |                           |      |
|  29 |   7 | Mobile Computing Lab      |  1.5 | Remove   |     |                           |      |
|  30 |   7 | Computer Graphics and Multimedia |    3 | Remove   |     |                           |      |
|  31 |   7 | Computer Graphics and Multimedia Lab |  1.5 | Remove   |     |                           |      |
|  32 |   7 | Object Oriented Analysis and Design |    3 | Remove   |     |                           |      |
|  33 |     |                           |      | Add      |   7 | Software Architecture     |    3 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           | 36.5 | -21.     |     |                           | 15.5 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     | *EEC*                     |      |          |     |                           |      |
|  34 |   4 | Interpersonal Skills      |    1 | Remove   |     |                           |      |
|  35 |   6 | Mini Project              |  1.5 | Remove   |     |                           |      |
|  36 |     |                           |      | Add      |   7 | Project Work Phase 1      |    3 |
|  37 |     |                           |      | Add      |   7 | Industrial Training / Internship |    2 |
|  38 |   8 | Project Work              |    9 | Rename   |   8 | Project Work Phase 2      |    8 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           | 11.5 | 1.5      |     |                           |   13 |
|-----+-----+---------------------------+------+----------+-----+---------------------------+------|
|     |     |                           | 66.5 | -14.     |     |                           | 52.5 |
#+tblfm: @11$4='(+ @-I..@-II);N::@11$8='(+ @-I..@-II);N::@11$5=@$8-@$4;N
#+tblfm: @14$4='(+ @-I..@-II);N::@14$8='(+ @-I..@-II);N::@14$5=@$8-@$4;N
#+tblfm: @24$4='(+ @-I..@-II);N::@24$8='(+ @-I..@-II);N::@24$5=@$8-@$4;N
#+tblfm: @43$4='(+ @-I..@-II);N::@43$8='(+ @-I..@-II);N::@43$5=@$8-@$4;N
#+tblfm: @50$4='(+ @-I..@-II);N::@50$8='(+ @-I..@-II);N::@50$5=@$8-@$4;N
#+tblfm: @>$4='(+ @II+1 @IIII+1 @IIIIII+1 @IIIIIIII+1 @IIIIIIIIII+1);N
#+tblfm: @>$8='(+ @II+1 @IIII+1 @IIIIII+1 @IIIIIIII+1 @IIIIIIIIII+1);N
#+tblfm: @>$5=@>$8-@>$4

| *Total credits reduced* = | -11 |
#+tblfm: @1$2=remote(changes, @55$5)+3;N

** Number of subjects in EFP format -- specify subject with sem of offer
| Semester | Subject                                    | Cat | Hrs | L | T | P |   C |
|----------+--------------------------------------------+-----+-----+---+---+---+-----|
|        2 | Engineering Fundamentals and Practices     | ES  |   3 | 3 | 0 | 0 |   3 |
|        2 | Engineering Fundamentals and Practices Lab | ES  |   3 | 0 | 0 | 0 | 1.5 |
|        4 | Database Lab                               | PC  |   4 | 0 | 0 | 4 |   2 |
|        6 | Machine Learning Lab                       | PC  |   4 | 0 | 0 | 4 |   2 |

** Have you addressed all the overlapping / common name subjects? Pl specify.
   (Pl use the list provided earlier as Annexure and on it- indicate
   how each has been rectified.)
   - We discussed about the common courses with the concerned
     departments. Wherever the coverage and emphasis was the same, we
     kept the syllabus also common.
   - Where they differed significantly, we decided to keep the course
     titles different.

** Are all open electives in even semesters?  Yes

** Is any sem having more than eight items ? No

** Have you grouped electives list semester wise? Yes

** Have you provided a list of Open electives semesterwise? Yes

#+latex: \newpage
* COMMENT To be decided
1. Remove PC?
   1. Distributed Systems (3), Sem 7 -- *Keep*
   2. Mobile Computing Theory (3), Sem 7 -- Remove
   3. Mobile Computing Lab (2), Sem 7 -- Remove
2. Move PC to ES -- *No*
   1. Statistical Learning (3), Sem 7 -- Machine Learning (3), Sem 6
   2. Statistical Learning (2), Sem 7 -- Machine Learning (2), Sem 6
3. Add EEC -- *No*
   1. Miniproject (2), Sem 4

* Curriculum R2021

#+attr_latex: :environment longtable :align @{}p{.04\textwidth}p{.06\textwidth}p{.5\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}
#+name: curriculum
|    |      |                                                                    |     |     |    |   |    |     |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
| No | Code | Title                                                              | Cat | Hrs |  L | T |  P |   C |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester I*                                                       |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Technical English                                                  | HS  |   4 |  2 | 0 |  2 |   3 |
|  2 |      | Algebra and Calculus                                               | BS  |   4 |  3 | 1 |  0 |   4 |
|  3 |      | Engineering Physics                                                | BS  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Engineering Chemistry                                              | BS  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Problem Solving and Programming in Python                          | ES  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Engineering Graphics                                               | ES  |   5 |  1 | 0 |  4 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Physics and Chemistry Lab                                          | BS  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Programming in Python Lab                                          | ES  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  28 | 15 | 1 | 12 | 22. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester II*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Complex Functions and Laplace Transforms                           | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Basic Electrical and Electronics Engineering                       | ES  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Engineering Fundamentals and Practices                             | ES  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Environmental Science                                              | BS  |   3 |  3 | 0 |  0 |   0 |
|  5 |      | Humanities Elective I                                              | HS  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Foundations of Data Science                                        | ES  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | EFP Lab                                                            | ES  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Design Thinking and Engineering Practices Lab                      | ES  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  25 | 18 | 1 |  6 | 19. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester III*                                                     |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Discrete Mathematics                                               | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Universal Human Values II                                          | HS  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Digital Principles and System Design                               | ES  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Data Structures                                                    | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Object Oriented Programming                                        | PC  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  6 |      | Digital Design Lab                                                 | ES  |   3 |  0 | 0 |  3 | 1.5 |
|  7 |      | Data Structures Lab                                                | PC  |   4 |  0 | 0 |  4 |   2 |
|  8 |      | Object Oriented Programming Lab                                    | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 15 | 1 | 10 | 21. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester IV*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Probability and Statistics                                         | BS  |   4 |  3 | 1 |  0 |   4 |
|  2 |      | Essence of Indian Traditional Knowledge / Indian Constitution (MC) | HS  |   3 |  3 | 0 |  0 |   0 |
|  3 |      | Computer Organization and Architecture                             | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Operating Systems                                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Design and Analysis of Algorithms                                  | PC  |   5 |  3 | 0 |  2 |   4 |
|  6 |      | Database Management Systems (EFP)                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Operating Systems Lab                                              | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Database Lab (EFP)                                                 | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  27 | 18 | 1 |  8 | 20. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester V*                                                       |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Computer Networks                                                  | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Microprocessors and Interfacing                                    | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Theory of Computation                                              | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Software Engineering                                               | PC  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Professional Elective 1                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Management Elective                                                | HS  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Networks Lab                                                       | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Microprocessors Lab                                                | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  24 | 18 | 0 |  6 | 21. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VI*                                                      |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Internet Programming                                               | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Data Security and Privacy                                          | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Machine Learning (EFP)                                             | PC  |   3 |  3 | 0 |  0 |   3 |
|  4 |      | Artificial Intelligence                                            | PC  |   5 |  3 | 0 |  2 |   4 |
|  5 |      | Professional Elective 2                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Open Elective 1                                                    | OE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Internet Programming Lab                                           | PC  |   3 |  0 | 0 |  3 | 1.5 |
|  8 |      | Machine Learning Lab (EFP)                                         | PC  |   3 |  0 | 0 |  3 | 1.5 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 18 | 0 |  8 | 22. |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VII*                                                     |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Distributed Systems                                                | PC  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Software Architecture                                              | PC  |   3 |  3 | 0 |  0 |   3 |
|  3 |      | Compiler Design                                                    | PC  |   5 |  3 | 0 |  2 |   4 |
|  4 |      | Professional Elective 3                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  5 |      | Professional Elective 4                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  6 |      | Professional Elective 5                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  7 |      | Project Work Phase 1                                               | EEC |   6 |  0 | 0 |  6 |   3 |
|  8 |      | Industrial Training / Internship                                   | EEC |   0 |  0 | 0 |  0 |   2 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | /Total/                                                            |     |  26 | 18 | 0 |  8 |  24 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Semester VIII*                                                    |     |     |    |   |    |     |
|    |      | /Theory/                                                           |     |     |    |   |    |     |
|  1 |      | Professional Elective 6                                            | PE  |   3 |  3 | 0 |  0 |   3 |
|  2 |      | Open Elective 2                                                    | OE  |   3 |  3 | 0 |  0 |   3 |
|    |      | /Practical/                                                        |     |     |    |   |    |     |
|  3 |      | Project Work Phase 2                                               | EEC |  16 |  0 | 0 | 16 |   8 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | Total                                                              |     |  22 |  6 | 0 | 16 |  14 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
|    |      | *Grand Total*                                                      |     |     |    |   |    | 163 |
|----+------+--------------------------------------------------------------------+-----+-----+----+---+----+-----|
#+TBLFM: @14$5..@14$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @26$5..@26$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @38$5..@38$>=vsum(@-II+3..@-5)+vsum(@-3..@-1)
#+TBLFM: @50$5..@50$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @62$5..@62$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @74$5..@74$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @86$5..@86$>=vsum(@-II+3..@-4)+vsum(@-2..@-1)
#+TBLFM: @93$5..@93$>=vsum(@-II+3..@-3)+vsum(@-1..@-1)
#+TBLFM: @94$9=@III+1+@IIIII+1+@IIIIIII+1+@IIIIIIIII+1+@IIIIIIIIIII+1+@IIIIIIIIIIIII+1+@IIIIIIIIIIIIIII+1+@IIIIIIIIIIIIIIIII+1;%3d


#+latex: \newpage
#+attr_latex: :environment longtable :align @{}p{.04\textwidth}p{.06\textwidth}p{.5\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}p{.05\textwidth}
|    |       |                                           |     |     |   |   |   |   |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
| No | Code  | Title                                     | Cat | Hrs | L | T | P | C |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 1*                 |     |     |   |   |   |   |
|  1 | PE101 | Big Data Analytics/Technologies           | PC  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE102 | Software Testing                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE103 | Image Processing and Analysis             | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE104 | Statistical Inference                     | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE105 | Introduction to Cryptographic Techniques  | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE106 | Ethical Hacking                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE107 | Functional Programming                    | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 2*                 |     |     |   |   |   |   |
|  1 | PE201 | Cloud Computing                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE202 | Big Data Management                       | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE203 | Software Configuration Management         | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE204 | Probablistic Graphical Models             | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE205 | Time Series Analysis and Forecasting      | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE206 | Cyber Forensics                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE207 | Wireless and Adhoc Networks               | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 3*                 |     |     |   |   |   |   |
|  1 | PE301 | Bayesian Data Analysis (AI&DS)            | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE302 | Internet of Things                        | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE303 | Object Oriented Analysis and Design       | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE304 | Data Warehousing and Data Mining (BDMA)   | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE305 | Deep Learning Techniques                  | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE306 | Multicore Architectures and GPU Computing | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE307 | Network and Server Security               | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 4*                 |     |     |   |   |   |   |
|  1 | PE401 | Healthcare  Analytics                     | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE402 | User Experience Design                    | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE403 | Social Network Analysis                   | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE404 | Computer Vision                           | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE405 | Blockchain Technologies                   | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE406 | Embedded systems                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE407 | Computer Graphics and Multimedia          | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 5*                 |     |     |   |   |   |   |
|  1 | PE501 | Bioinformatics                            | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE502 | Agile Methodologies                       | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE503 | Natural Language Processing               | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE504 | Robotics                                  | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE505 | Speech Processing and Synthesis           | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE506 | Mobile computing                          | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE507 | Mobile and Wireless Security              | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Professional Elective 6*                 |     |     |   |   |   |   |
|  1 | PE601 | Business Analytics                        | PE  |   3 | 3 | 0 | 0 | 3 |
|  2 | PE602 | Formal System Verification                | PE  |   3 | 3 | 0 | 0 | 3 |
|  3 | PE603 | Service Oriented Architecture             | PE  |   3 | 3 | 0 | 0 | 3 |
|  4 | PE604 | Information Retrieval Techniques (BDMA)   | PE  |   3 | 3 | 0 | 0 | 3 |
|  5 | PE605 | Reinforcement Learning                    | PE  |   3 | 3 | 0 | 0 | 3 |
|  6 | PE606 | Software Defined Networks                 | PE  |   3 | 3 | 0 | 0 | 3 |
|  7 | PE607 | Parallel Algorithms                       | PE  |   3 | 3 | 0 | 0 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Open Electives 1*                        |     |     |   |   |   |   |
|  1 | OE1   | Introduction to Data Structures           | OE  |   4 | 2 | 0 | 2 | 3 |
|  2 | OE2   | Object Oriented Programming Techniques    | OE  |   4 | 2 | 0 | 2 | 3 |
|  3 | OE3   | Problem Solving and Programming in C      | OE  |   4 | 2 | 0 | 2 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|
|    |       | *Open Electives 2*                        |     |     |   |   |   |   |
|  4 | OE4   | Introduction to Big Data Analytics        | OE  |   4 | 2 | 0 | 2 | 3 |
|  5 | OE5   | Machine Learning Applications             | OE  |   4 | 2 | 0 | 2 | 3 |
|  6 | OE6   | Web Technology                            | OE  |   4 | 2 | 0 | 2 | 3 |
|----+-------+-------------------------------------------+-----+-----+---+---+---+---|

** COMMENT Specialization
| PE1                                                         | PE2                                                        | PE3                                                                   | PE4                                     | PE5                                                                  | PE6                                                            |
+-------------------------------------------------------------+------------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------+----------------------------------------------------------------------+----------------------------------------------------------------|
| Semester 5                                                  | Semester 6                                                 | Semester 7                                                            | Semester 7                              | Semester 7                                                           | Semester 8                                                     |
+-------------------------------------------------------------+------------------------------------------------------------+-----------------------------------------------------------------------+-----------------------------------------+----------------------------------------------------------------------+----------------------------------------------------------------|
| Big Data Technologies                                       | Cloud Computing Big Data Management                        | Bayesian Data Analysis (AI&DS) Internet of Things                     | Healthcare  Analytics                   | Bio Informatics                                                      | Business Analytics                                             |
| Software Testing                                            | Software Project Management                                | Service Oriented Architecture                                         | User Experience Design                  | Agile Methodologies                                                  | Formal System Verification, Software Architectures             |
| Image Processing and Analysis Probablistic Graphical Models | Statistical Inference Time Series Analysis and Forecasting | Data Warehousing and Data Mining (BDMA) Deep Learning                 | Social Network Analysis Computer Vision | Natural Language Processing Robotics Speech Processing and Synthesis | Information Retrieval Techniques (BDMA), Reinforcement Learning |
| Cryptographic techniques Ethical Hacking                    | Cyber Forensics Wireless and Adhoc Networks                | Multicore Architectures and GPU Computing Network and Server Security | Blockchain Technologies                 | Mobile computing Mobile and Wireless Security                        | Software Defined Networks                                      |

** Specialization
# +latex:  \hyphenpenalty=10000
#+latex: \newcolumntype{Y}{>{\small\raggedright\arraybackslash}X}
#+attr_latex: :environment tabularx :width \textwidth :align cYYYY
| PE | /Big Data Management and Analytics/ | /Software Engineering and Architectures/ | /AI and Data Science/                    | /Networks and Security/                   |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  1 | Big Data Technologies               | Software Testing                         | Image Processing and Analysis,           | Cryptographic Techniques,                 |
|    |                                     |                                          | Probablistic Graphical Models            | Ethical Hacking                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  2 | Cloud Computing,                    | Software Configuration Management        | Statistical Inference,                   | Cyber Forensics,                          |
|    | Big Data Management                 |                                          | Time Series Analysis and Forecasting     | Wireless and Adhoc Networks               |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  3 | Bayesian Data Analysis (AIDS),      | Object Orineted Analysis and Design      | Data Warehousing and Data Mining (BDMA), | Multicore Architecture and GPU Computing, |
|    | Internet of Things                  |                                          | Deep Learning Techniques                 | Network and Server Security               |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  4 | Healthcare  Analytics               | User Experience Design                   | Social Network Analysis,                 | Blockchain Technologies                   |
|    |                                     |                                          | Computer Vision                          |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  5 | Bio Informatics                     | Agile Methodologies                      | Natural Language Processing,             | Mobile Computing,                         |
|    |                                     |                                          | Robotics,                                | Mobile and Wireless Security              |
|    |                                     |                                          | Speech Processing and Synthesis          |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|
|  6 | Business Analytics                  | Formal System Verification               | Information Retrieval Techniques (BDMA)  | Software Defined Networks                 |
|    |                                     | Service Oriented Architecture            | Reinforcement Learning                   |                                           |
|----+-------------------------------------+------------------------------------------+------------------------------------------+-------------------------------------------|

#+NAME: categorywise_courses
#+HEADER: :colnames yes
#+BEGIN_SRC python :var curriculum=curriculum :results output raw :exports none
row_header = ['SNo', 'Code', 'Course', 'Hrs',  'L', 'T', 'P', 'C'];
category_tab = []
category_tab.append(row_header)
categories = ['HS', 'BS', 'ES', 'PC', 'PE', 'OE', 'EEC']
category_dict = {cat:[] for cat in categories}
sem = 0
state = 1
for row in curriculum:
    subject = row[2]
    category = row[3]
    if state == 1 and 'Semester' in subject:
        sem += 1
        state = 2
    elif state == 2: # 'Theory' in subject
        state = 3
    elif state == 3: # Actual subject row
        state = 4
    elif state == 4 and 'Practical' in subject:
        state = 5
    elif state == 5:
        state = 6
    elif state == 6 and 'Total' in subject:
        state = 1
    if state == 4 or state == 6:
        #print (row[1:3]+row[4:])
        category_dict[category].append(row[1:3]+row[4:])
#print (category_dict)
for cat in categories:
    print ('** '+cat)
    print('|', end='')
    print ('|'.join(map(str, row_header)), end='')
    print ('|')
    hline = ['-' for row in row_header]
    print('|', end='')
    print ('|'.join(map(str, hline)), end='')
    print ('|')
    for i, row in enumerate(category_dict[cat]):
        print ('|', i+1, '|', end='')
        print ('|'.join(map(str, row)), end='')
        print('|')
    print('|', end='')
    print ('|'.join(map(str, hline)), end='')
    print ('|')
    print('|', end='')
    print ('|'.join([' ' for item in hline]), end='')
    print ('|')
    print('|', end='')
    print ('|'.join(map(str, hline)), end='')
    print ('|')
    print ('#+tblfm: @>$3..@>$>=vsum(@1..@>>);N')
#+END_SRC

#+RESULTS: categorywise_courses
** HS
| SNo | Code | Course                                                             | Hrs |  L | T | P |  C |
|-----+------+--------------------------------------------------------------------+-----+----+---+---+----|
|   1 |      | Technical English                                                  |   4 |  2 | 0 | 2 |  3 |
|   2 |      | Humanities Elective I                                              |   3 |  3 | 0 | 0 |  3 |
|   3 |      | Universal Human Values II                                          |   3 |  3 | 0 | 0 |  3 |
|   4 |      | Essence of Indian Traditional Knowledge / Indian Constitution (MC) |   3 |  3 | 0 | 0 |  0 |
|   5 |      | Management Elective                                                |   3 |  3 | 0 | 0 |  3 |
|-----+------+--------------------------------------------------------------------+-----+----+---+---+----|
|     |      | 0                                                                  |  16 | 14 | 0 | 2 | 12 |
|-----+------+--------------------------------------------------------------------+-----+----+---+---+----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** BS
| SNo | Code | Course                                   | Hrs |  L | T | P |    C |
|-----+------+------------------------------------------+-----+----+---+---+------|
|   1 |      | Algebra and Calculus                     |   4 |  3 | 1 | 0 |    4 |
|   2 |      | Engineering Physics                      |   3 |  3 | 0 | 0 |    3 |
|   3 |      | Engineering Chemistry                    |   3 |  3 | 0 | 0 |    3 |
|   4 |      | Physics and Chemistry Lab                |   3 |  0 | 0 | 3 |  1.5 |
|   5 |      | Complex Functions and Laplace Transforms |   4 |  3 | 1 | 0 |    4 |
|   6 |      | Environmental Science                    |   3 |  3 | 0 | 0 |    0 |
|   7 |      | Discrete Mathematics                     |   4 |  3 | 1 | 0 |    4 |
|   8 |      | Probability and Statistics               |   4 |  3 | 1 | 0 |    4 |
|-----+------+------------------------------------------+-----+----+---+---+------|
|     |      | 0                                        |  28 | 21 | 4 | 3 | 23.5 |
|-----+------+------------------------------------------+-----+----+---+---+------|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** ES
| SNo | Code | Course                                        | Hrs |  L | T |  P |   C |
|-----+------+-----------------------------------------------+-----+----+---+----+-----|
|   1 |      | Problem Solving and Programming in Python     |   3 |  3 | 0 |  0 |   3 |
|   2 |      | Engineering Graphics                          |   5 |  1 | 0 |  4 |   3 |
|   3 |      | Programming in Python Lab                     |   3 |  0 | 0 |  3 | 1.5 |
|   4 |      | Basic Electrical and Electronics Engineering  |   3 |  3 | 0 |  0 |   3 |
|   5 |      | Engineering Fundamentals and Practices        |   3 |  3 | 0 |  0 |   3 |
|   6 |      | Foundations of Data Science                   |   3 |  3 | 0 |  0 |   3 |
|   7 |      | EFP Lab                                       |   3 |  0 | 0 |  3 | 1.5 |
|   8 |      | Design Thinking and Engineering Practices Lab |   3 |  0 | 0 |  3 | 1.5 |
|   9 |      | Digital Principles and System Design          |   3 |  3 | 0 |  0 |   3 |
|  10 |      | Digital Design Lab                            |   3 |  0 | 0 |  3 | 1.5 |
|-----+------+-----------------------------------------------+-----+----+---+----+-----|
|     |      | 0                                             |  32 | 16 | 0 | 16 | 24. |
|-----+------+-----------------------------------------------+-----+----+---+----+-----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** PC
| SNo | Code | Course                                 | Hrs |  L | T |  P |    C |
|-----+------+----------------------------------------+-----+----+---+----+------|
|   1 |      | Data Structures                        |   3 |  3 | 0 |  0 |    3 |
|   2 |      | Object Oriented Programming            |   3 |  3 | 0 |  0 |    3 |
|   3 |      | Data Structures Lab                    |   4 |  0 | 0 |  4 |    2 |
|   4 |      | Object Oriented Programming Lab        |   3 |  0 | 0 |  3 |  1.5 |
|   5 |      | Computer Organization and Architecture |   3 |  3 | 0 |  0 |    3 |
|   6 |      | Operating Systems                      |   3 |  3 | 0 |  0 |    3 |
|   7 |      | Design and Analysis of Algorithms      |   5 |  3 | 0 |  2 |    4 |
|   8 |      | Database Management Systems (EFP)      |   3 |  3 | 0 |  0 |    3 |
|   9 |      | Operating Systems Lab                  |   3 |  0 | 0 |  3 |  1.5 |
|  10 |      | Database Lab (EFP)                     |   3 |  0 | 0 |  3 |  1.5 |
|  11 |      | Computer Networks                      |   3 |  3 | 0 |  0 |    3 |
|  12 |      | Microprocessors and Interfacing        |   3 |  3 | 0 |  0 |    3 |
|  13 |      | Theory of Computation                  |   3 |  3 | 0 |  0 |    3 |
|  14 |      | Software Engineering                   |   3 |  3 | 0 |  0 |    3 |
|  15 |      | Networks Lab                           |   3 |  0 | 0 |  3 |  1.5 |
|  16 |      | Microprocessors Lab                    |   3 |  0 | 0 |  3 |  1.5 |
|  17 |      | Internet Programming                   |   3 |  3 | 0 |  0 |    3 |
|  18 |      | Data Security and Privacy              |   3 |  3 | 0 |  0 |    3 |
|  19 |      | Machine Learning (EFP)                 |   3 |  3 | 0 |  0 |    3 |
|  20 |      | Artificial Intelligence                |   5 |  3 | 0 |  2 |    4 |
|  21 |      | Internet Programming Lab               |   3 |  0 | 0 |  3 |  1.5 |
|  22 |      | Machine Learning Lab (EFP)             |   3 |  0 | 0 |  3 |  1.5 |
|  23 |      | Distributed Systems                    |   3 |  3 | 0 |  0 |    3 |
|  24 |      | Software Architecture                  |   3 |  3 | 0 |  0 |    3 |
|  25 |      | Compiler Design                        |   5 |  3 | 0 |  2 |    4 |
|-----+------+----------------------------------------+-----+----+---+----+------|
|     |      | 0                                      |  82 | 51 | 0 | 31 | 66.5 |
|-----+------+----------------------------------------+-----+----+---+----+------|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** PE
| SNo | Code | Course                  | Hrs |  L | T | P |  C |
|-----+------+-------------------------+-----+----+---+---+----|
|   1 |      | Professional Elective 1 |   3 |  3 | 0 | 0 |  3 |
|   2 |      | Professional Elective 2 |   3 |  3 | 0 | 0 |  3 |
|   3 |      | Professional Elective 3 |   3 |  3 | 0 | 0 |  3 |
|   4 |      | Professional Elective 4 |   3 |  3 | 0 | 0 |  3 |
|   5 |      | Professional Elective 5 |   3 |  3 | 0 | 0 |  3 |
|   6 |      | Professional Elective 6 |   3 |  3 | 0 | 0 |  3 |
|-----+------+-------------------------+-----+----+---+---+----|
|     |      | 0                       |  18 | 18 | 0 | 0 | 18 |
|-----+------+-------------------------+-----+----+---+---+----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** OE
| SNo | Code | Course          | Hrs | L | T | P | C |
|-----+------+-----------------+-----+---+---+---+---|
|   1 |      | Open Elective 1 |   3 | 3 | 0 | 0 | 3 |
|   2 |      | Open Elective 2 |   3 | 3 | 0 | 0 | 3 |
|-----+------+-----------------+-----+---+---+---+---|
|     |      | 0               |   6 | 6 | 0 | 0 | 6 |
|-----+------+-----------------+-----+---+---+---+---|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
** EEC
| SNo | Code | Course                           | Hrs | L | T |  P |  C |
|-----+------+----------------------------------+-----+---+---+----+----|
|   1 |      | Project Work Phase 1             |   6 | 0 | 0 |  6 |  3 |
|   2 |      | Industrial Training / Internship |   0 | 0 | 0 |  0 |  2 |
|   3 |      | Project Work Phase 2             |  16 | 0 | 0 | 16 |  8 |
|-----+------+----------------------------------+-----+---+---+----+----|
|     |      | 0                                |  22 | 0 | 0 | 22 | 13 |
|-----+------+----------------------------------+-----+---+---+----+----|
#+tblfm: @>$3..@>$>=vsum(@1..@>>);N
